In [1]:
!pip install ipython-sql
%load_ext sql
import os
USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'
CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    USER,
    PASSWORD,
    POSTGRESQL_HOST,
    DBASE_NAME
)

Requirement already satisfied: ipython-sql in /opt/conda/lib/python3.10/site-packages (0.5.0)
Requirement already satisfied: ipython-genutils in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlparse in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: sqlalchemy>=2.0 in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (2.0.7)
Requirement already satisfied: ipython in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (8.11.0)
Requirement already satisfied: prettytable in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: six in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: typing-extensions>=4.2.0 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: matplotlib-inline in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: decorator in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: pickleshare in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: pexpect>4.3 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: backcall in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: stack-data in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: pygments>=2.4.0 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (2.14.0)
Requirement already satisfied: traitlets>=5 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (3.0.38)
Requirement already satisfied: jedi>=0.16 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.18.2)
Requirement already satisfied: wcwidth in /opt/conda/lib/python3.10/site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /opt/conda/lib/python3.10/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.10/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: pure-eval in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: executing>=1.2.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (1.2.0)
Requirement already satisfied: asttokens>=2.1.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (2.2.1)
WARNING: There was an error checking the latest version of pip.

In [47]:
#ticket_no  0005432312164, find: who and where flew
#Provide solutions in 3 ways:
#- a query with subqueries (nested queries)
#- a query with no subqueries and no joins
#- a query with joins

**1. A query with subqueries (nested queries)**

In [56]:
%%sql $CONNECT_DATA
SELECT passenger_id, passenger_name, b.ticket_no, arrival_airport, departure_airport
FROM Flights f
JOIN (SELECT passenger_id, passenger_name, a.ticket_no, flight_id 
     FROM Ticket_flights 
     JOIN (SELECT passenger_id, passenger_name, ticket_no 
          FROM Tickets
          WHERE ticket_no = '0005432312164') as a
      ON a.ticket_no = Ticket_flights.ticket_no) as b
ON b.flight_id = f.flight_id

4 rows affected.

[('0423 646487', 'ALEKSEY GERASIMOV', '0005432312164', 'EGO', 'DME'),
 ('0423 646487', 'ALEKSEY GERASIMOV', '0005432312164', 'EGO', 'AAQ'),
 ('0423 646487', 'ALEKSEY GERASIMOV', '0005432312164', 'DME', 'EGO'),
 ('0423 646487', 'ALEKSEY GERASIMOV', '0005432312164', 'AAQ', 'EGO')]

**2. A query with no subqueries and no joins**

In [10]:
%%sql $CONNECT_DATA
SELECT passenger_id, passenger_name, s.ticket_no, departure_airport, arrival_airport
FROM Tickets s, Ticket_flights tf, Flights f
WHERE s.ticket_no = tf.ticket_no
AND tf.flight_id = f.flight_id
AND s.ticket_no = '0005432312164'

4 rows affected.

[('0423 646487', 'ALEKSEY GERASIMOV', '0005432312164', 'DME', 'EGO'),
 ('0423 646487', 'ALEKSEY GERASIMOV', '0005432312164', 'AAQ', 'EGO'),
 ('0423 646487', 'ALEKSEY GERASIMOV', '0005432312164', 'EGO', 'DME'),
 ('0423 646487', 'ALEKSEY GERASIMOV', '0005432312164', 'EGO', 'AAQ')]

**3. A query with joins**

In [12]:
%%sql $CONNECT_DATA
SELECT passenger_id, passenger_name, s.ticket_no, departure_airport, arrival_airport
FROM Tickets s
JOIN Ticket_flights USING (ticket_no) 
JOIN Flights USING (flight_id)
WHERE s.ticket_no = '0005432312164'

4 rows affected.

[('0423 646487', 'ALEKSEY GERASIMOV', '0005432312164', 'DME', 'EGO'),
 ('0423 646487', 'ALEKSEY GERASIMOV', '0005432312164', 'AAQ', 'EGO'),
 ('0423 646487', 'ALEKSEY GERASIMOV', '0005432312164', 'EGO', 'DME'),
 ('0423 646487', 'ALEKSEY GERASIMOV', '0005432312164', 'EGO', 'AAQ')]

**Extended solution about Mrs. 'ELLA DMITRIEVA'**

In [34]:
%%sql $CONNECT_DATA
SELECT 
passenger_name,
flight_id,
a.city as departure_city, 
b.city as arrival_city
FROM Flights f
JOIN Ticket_flights USING (flight_id)
JOIN Tickets USING (ticket_no)
JOIN Airports a
ON f.departure_airport = a.airport_code
JOIN Airports b
ON f.arrival_airport = b.airport_code
WHERE passenger_name = 'ELLA DMITRIEVA'

7 rows affected.

[('ELLA DMITRIEVA', 11445, 'Moscow', 'Khanty-Mansiysk'),
 ('ELLA DMITRIEVA', 142605, 'Khanty-Mansiysk', 'Moscow'),
 ('ELLA DMITRIEVA', 34407, 'Moscow', 'Yekaterinburg'),
 ('ELLA DMITRIEVA', 70804, 'Yekaterinburg', 'Moscow'),
 ('ELLA DMITRIEVA', 74285, 'Yekaterinburg', 'Magnetiogorsk'),
 ('ELLA DMITRIEVA', 193132, 'Magnetiogorsk', 'Yekaterinburg'),
 ('ELLA DMITRIEVA', 8202, 'Moscow', 'Yuzhno-Sakhalinsk')]

**Aircraft model/Total number of seats ordered by the number of seats**

In [43]:
%%sql $CONNECT_DATA
SELECT model as Aircraft_model, COUNT(seat_no) as Number_of_seats_in_the_model
FROM Seats s, Aircrafts a
WHERE s.aircraft_code = a.aircraft_code
GROUP BY model
ORDER BY Number_of_seats_in_the_model desc

9 rows affected.

[('Boeing 777-300', 402),
 ('Boeing 767-300', 222),
 ('Airbus A321-200', 170),
 ('Airbus A320-200', 140),
 ('Boeing 737-300', 130),
 ('Airbus A319-100', 116),
 ('Sukhoi Superjet-100', 97),
 ('Bombardier CRJ-200', 50),
 ('Cessna 208 Caravan', 12)]

In [ ]:
#Bonus - count with fare conditions

In [46]:
%%sql $CONNECT_DATA
SELECT model as Aircraft_model, fare_conditions, COUNT(seat_no) as Number_of_seats_in_the_model
FROM Seats s, Aircrafts a
WHERE s.aircraft_code = a.aircraft_code
GROUP BY model, fare_conditions
ORDER BY Number_of_seats_in_the_model desc

17 rows affected.

[('Boeing 777-300', 'Economy', 324),
 ('Boeing 767-300', 'Economy', 192),
 ('Airbus A321-200', 'Economy', 142),
 ('Airbus A320-200', 'Economy', 120),
 ('Boeing 737-300', 'Economy', 118),
 ('Airbus A319-100', 'Economy', 96),
 ('Sukhoi Superjet-100', 'Economy', 85),
 ('Bombardier CRJ-200', 'Economy', 50),
 ('Boeing 777-300', 'Comfort', 48),
 ('Boeing 777-300', 'Business', 30),
 ('Boeing 767-300', 'Business', 30),
 ('Airbus A321-200', 'Business', 28),
 ('Airbus A319-100', 'Business', 20),
 ('Airbus A320-200', 'Business', 20),
 ('Sukhoi Superjet-100', 'Business', 12),
 ('Cessna 208 Caravan', 'Economy', 12),
 ('Boeing 737-300', 'Business', 12)]